src/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЦенПродажи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/Номенклатура/Forms/ФормаСозданияЦены/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(_, __)
	ЭтотОбъект.ДатаНачалаДействияЦены = НачалоДня(ТекущаяДатаСеанса());
	ЭтотОбъект.Номенклатура = Параметры.Номенклатура;
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиКомандФормы

&НаСервере
Процедура ЗаписатьНаСервере()
	наборЗаписейРегистра_ = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
	наборЗаписейРегистра_.Отбор.Номенклатура.Установить(Номенклатура);
	наборЗаписейРегистра_.Отбор.ВидЦены.Установить(ВидЦены);
	наборЗаписейРегистра_.Отбор.Период.Установить(ДатаНачалаДействияЦены);

	наборЗаписейРегистра_.Прочитать();
	Если наборЗаписейРегистра_.Количество() Тогда
		наборЗаписейРегистра_[0].Цена = Цена;
	Иначе
		новаяЗаписьЦены_ = наборЗаписейРегистра_.Добавить();
		новаяЗаписьЦены_.Номенклатура = Номенклатура;
		новаяЗаписьЦены_.ВидЦены = ВидЦены;
		новаяЗаписьЦены_.Период = ДатаНачалаДействияЦены;
		новаяЗаписьЦены_.Цена = Цена;
	КонецЕсли;

	наборЗаписейРегистра_.Записать();
КонецПроцедуры

&НаКлиенте
Процедура Записать(_)
	ценаНаДату_ = РаботаСЦенамиВызовСервера.ПолучитьЦенуНаКонкретнуюДату(
			ЭтотОбъект.Номенклатура, ЭтотОбъект.ВидЦены, ЭтотОбъект.ДатаНачалаДействияЦены);
	Если ценаНаДату_ <> Неопределено Тогда

		текстВопроса_ = СтрШаблон("На указанную дату уже имеется введенная цена %1, вы действительно хотите изменить цену?", ценаНаДату_);
		оповещение_ = Новый ОписаниеОповещения("_послеОтветаНаВопросОбИзмененииЦены_ОВ", ЭтотОбъект);
		ПоказатьВопрос(оповещение_, текстВопроса_, РежимДиалогаВопрос.ДаНет, , , "Внимание!");
	Иначе
		ЗаписатьНаСервере();
		Закрыть();

	КонецЕсли;
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныйПрограммныйИнтерфейс

&НаКлиенте
Процедура _послеОтветаНаВопросОбИзмененииЦены_ОВ(результатДиалога, __) Экспорт
	Если результатДиалога = КодВозвратаДиалога.Да Тогда
		ЗаписатьНаСервере();
		Закрыть();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти // СлужебныйПрограммныйИнтерфейс
